mod3-final-project/currency_api/app/controllers/api/v1/currencies_controller.rb

  def index
    @currencies = Currency.all
---
SELECT "currencies".* FROM "currencies"

  def create
    @currency = Currency.create(currency_params)
---
INSERT INTO "currencies" ("original_currency", "conversion_currency", "amount_entered", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["original_currency", "ARS"], ["conversion_currency", "BHD"], ["amount_entered", 1232], ["created_at", "2018-02-13 19:03:02.947938"], ["updated_at", "2018-02-13 19:03:02.947938"]]

  def destroy
    @currency = Currency.find(params[:id])
    @currency.destroy
---
SELECT  "currencies".* FROM "currencies" WHERE "currencies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "currencies" WHERE "currencies"."id" = ?  [["id", 1]]